load-test-quiz.yml
config:
  target: "https://mindwave-edu.tech"
  phases:
    - duration: 10        # Ramp up over 10 seconds
      arrivalRate: 50     # 50 new users/sec = 500 total virtual users
      name: "500 Students Simultaneous Join Test"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Validate code → Join lobby → Poll quiz status (realistic student flow)"
    weight: 100
    flow:
      # STEP 1: Student enters the 6-digit PIN and validates it
      - post:
          url: "/api/quiz/validate"
          json:
            code: "{{ $env.QUIZ_CODE }}"

      # STEP 2: Brief pause (student reads the lobby screen)
      - think: 1

      # STEP 3: THE BIG ONE - 500 students all join the lobby simultaneously
      - post:
          url: "/api/quiz/{{ $env.QUIZ_CODE }}/join"
          headers:
            Authorization: "Bearer {{ $env.STUDENT_TOKEN }}"
          json: {}

      # STEP 4: Sitting in lobby - student polls for quiz status (every 3s in real life)
      - think: 2

      - get:
          url: "/api/quiz/{{ $env.QUIZ_CODE }}"

      - think: 2

      # STEP 5: Check leaderboard (happens after each question)
      - get:
          url: "/api/quiz/{{ $env.QUIZ_CODE }}/leaderboard"

      - think: 3

      # STEP 6: Student polls status one more time
      - get:
          url: "/api/quiz/{{ $env.QUIZ_CODE }}"